---
kind: method
id: M:Autodesk.Revit.DB.ExportLinetypeTable.Clear
source: html/969905cc-3f59-e94e-6cc5-97a504d164cf.htm
---
# Autodesk.Revit.DB.ExportLinetypeTable.Clear Method

Removes all contents stored in Export line type table.

## Syntax (C#)
```csharp
public void Clear()
```